# StairsTrisertypeRiserIsSlanted Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StairsTrisertypeRiserIsSlanted Property
ParameterTypeId Class See Also
---
"Slanted"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StairsTrisertypeRiserIsSlanted { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StairsTrisertypeRiserIsSlanted As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StairsTrisertypeRiserIsSlanted {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace